Public Attributes | List of all members
API_PublishPars Struct Reference
Project Operations
Publishing parameters. More...
#include <APIdefs_Automate.h>
 Public Attributes
API_Guid  | guid
Identifies the publisher set. Its value comes from the ACAPI_Navigator_GetNavigatorChildrenItems call.
IO::Location *  | path
Full path for local/LAN publishing.
Detailed Description
Publishing parameters.
Remarks
For an example please see the PublishTest() function in the Navigator_Test example.
Member Data Documentation
◆ guid
 API_PublishPars::guid
Identifies the publisher set. Its value comes from the ACAPI_Navigator_GetNavigatorChildrenItems call.
◆ path
 API_PublishPars::path
Full path for local/LAN publishing.